configuration/src/InformationRegisters/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Трудозатраты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Затрата</name>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </resources>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РольПользователя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоРабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/AccumulationRegisters/ОказанныеУслуги/ОказанныеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОказанныеУслуги</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

configuration/src/Documents/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Трудозатраты</name>
  <registerRecords>AccumulationRegister.ОказанныеУслуги</registerRecords>
  <registerRecords>InformationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Затрата</name>
    <comment>Затраченное время в часах</comment>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал пользователя на момент занесения трудозатрат</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Юридическое лицо объекта (или родительской заявки)</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/Documents/ВнутреннееЗадание/ВнутреннееЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееЗадание</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Служит для передачи значения от проекта к заявке. Не зависит от выбранного направления. Не отображается на форме</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/CommonModules/УчетТрудозатратВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции работы с трудозатратами и всем, что
// связано с ними. Доступны для вызова с клиента.
//
// - Трудозатраты.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает вид деятельности внутренних трудозатрат.
// Используется в инструментах (например, "Управление нагрузкой", "Мои задачи" и т.д.). 
//
// Параметры:
//  Ссылка	 - ДокументСсылка.ВнутренниеТрудозатраты - Ссылка на документ внутренние трудозатраты 
// 
// Возвращаемое значение:
//  ВидДеятельности - СправочникСсылка.ВидДеятельности - Ссылка на элемент справочника Вид деятельности
//
Функция ПолучитьВидДеятельностиВнутреннихТрудозатрат(Знач Ссылка) Экспорт

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидДеятельности");	
	
КонецФункции

// Возвращает структуру с данными по трудозатратам для формирования отчета.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, трудозатраты по которому нужно
//           получить.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьДанныеДляОтчета(Знач Ссылка) Экспорт
	
	Возврат РегистрыСведений.Трудозатраты.СформироватьДанныеДляОтчета(Ссылка);
	
КонецФункции

// Возвращает структуру с данными по стоимости объекта для формирования отчета.
//
// Параметры:
//  Объект - ДокументСсылка.ВнутреннееЗадание, ДокументСсылка.ЗаявкаНаРазработку - ссылка на документ, для которого рассчитывается стоимость
//  КраткоеПредставлениеОбъектаМетаданных - Строка - Представление объекта метаданных в родительном падеже, отображаемое в предупреждении
//		об отсутствии фактических затрат. Например: "заявки", "внутреннего задания"
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьДанныеДляОтчетаСтоимостиОбъекта(Знач Объект, Знач КраткоеПредставлениеОбъектаМетаданных) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Пустой", Истина);
	Результат.Вставить("Заголовок", "");
	Результат.Вставить("ТабличныйДокумент", Неопределено);
	
	ТипЗначенияОбъекта = ТипЗнч(Объект);
	
	Если ТипЗначенияОбъекта = Тип("ДокументСсылка.ЗаявкаНаРазработку") Тогда
		ТекстЗапроса = ТекстЗапросаДляЗаявкиНаРазработку();
	ИначеЕсли ТипЗначенияОбъекта = Тип("ДокументСсылка.ВнутреннееЗадание") Тогда
		ТекстЗапроса = ТекстЗапросаДляВнутреннегоЗадания();
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Объект", Объект);
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ВыборкаПредставления = ПакетыЗапроса[ПакетыЗапроса.ВГраница()].Выбрать();
	ВыборкаПредставления.Следующий();
	ПредставлениеОбъекта = ВыборкаПредставления.ПредставлениеОбъекта;
	
	СтоимостьОбъекта = 0;
	
	Макет = РегистрыСведений.Трудозатраты.ПолучитьМакет("СтоимостьОбъекта");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакета.Параметры.ПредставлениеОбъекта = ПредставлениеОбъекта;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	ВыборкаТрудозатрат = ПакетыЗапроса[ПакетыЗапроса.ВГраница() - 1].Выбрать();
	
	Пока ВыборкаТрудозатрат.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(ВыборкаТрудозатрат);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СтоимостьОбъекта = СтоимостьОбъекта + ВыборкаТрудозатрат.ОбщаяСтоимость;
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьМакета.Параметры.СтоимостьОбъекта = СтоимостьОбъекта;
	ОбластьМакета.Параметры.КраткоеПредставлениеОбъектаМетаданных = КраткоеПредставлениеОбъектаМетаданных;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Результат.Пустой = (ВыборкаТрудозатрат.Количество() = 0);
	Результат.Заголовок = СтрШаблон("Стоимость: %1", ПредставлениеОбъекта);
	Результат.ТабличныйДокумент = ТабличныйДокумент;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с данными трудозатрат.
//
// Параметры:
//  Ссылка      - ЛюбаяСсылка - ссылка на объект, трудозатраты по которому нужно
//                получить.
//  Подчиненные - Булево - признак получения трудозатрат по всей структуре подчиненности 
//                объекта.
//  ДобавитьСтоимость - Булево - признак добавления параметра со стоимостью заявки.
//                      Актуально для заявки.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьДанныеПоТрудозатратам(Знач Ссылка, Знач Подчиненные = Ложь, Знач ВидТрудозатрат = Неопределено, Знач ДобавитьСтоимость = Ложь, Знач ИмяФормы = "") Экспорт	
	
	Если ЗначениеЗаполнено(ИмяФормы) Тогда
		Функциональность = "Открытие вкладки ""Трудозатраты""";
		ОбщегоНазначенияВызовСервера.ОтслеживаниеИспользованияФункциональностиНаСервере(Функциональность, ИмяФормы);
	КонецЕсли;
	
	ДанныеТрудозатрат = РегистрыСведений.Трудозатраты.СформироватьДанныеДляФормы(Ссылка, , ВидТрудозатрат);
	
	Если ДобавитьСтоимость Тогда
		Стоимость = УчетТрудозатрат.ПолучитьСтоимостьРеализацииЗаявки(Ссылка);
		ДанныеТрудозатрат.Вставить("Стоимость", Стоимость);
	КонецЕсли;
	
	Возврат ДанныеТрудозатрат;
	
КонецФункции

// Возвращает структуру с датами, ограничивающими внесение трудозатрат и текущей датой.
//
// Возвращаемое значение:
// Структура - структура со свойствами.
// 	* НачалоПериода - Дата - минимальная разрешенная дата
// 	* КонецПериода - Дата - максимальная разрешенная дата
// 	* ТекущаяДатаСеанса - Дата - дата полученная методом ТекущаяДатаСеанса()
//
Функция ПолучитьРазрешенныйПериодДобавленияТрудозатрат() Экспорт
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	ДатаЗапрета = Константы.ДатаЗапретаИзмененияДанных.Получить();
	ДеньПослеЗапрета = ДатаЗапрета + 86400; // + 1 день
	
	РазрешенныйПериод = Новый Структура;
	РазрешенныйПериод.Вставить("НачалоПериода", ДеньПослеЗапрета);
	РазрешенныйПериод.Вставить("КонецПериода", НачалоДня(ТекущаяДатаСеанса));
	РазрешенныйПериод.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса);
	
	Возврат	РазрешенныйПериод;
	
КонецФункции

// Возвращает ключ записи для редактирования/удаления трудозатрат.
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - идентификатор записи регистра
//                  сведений - значение реквизита Идентификатор.
//
// Возвращаемое значение:
//  РегистрСведенийКлючЗаписи.Трудозатраты, Неопределено.
//
Функция ПолучитьКлючЗаписи(Знач Идентификатор) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Трудозатраты.Период КАК Период,
	//|	Трудозатраты.Задача КАК Задача
	//|ИЗ
	//|	РегистрСведений.Трудозатраты КАК Трудозатраты
	//|ГДЕ
	//|	Трудозатраты.Идентификатор = &Идентификатор";
	//
	//ИдентификаторЗаписи = Новый УникальныйИдентификатор(Идентификатор);
	//Запрос.УстановитьПараметр("Идентификатор", ИдентификаторЗаписи);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	
	//	СвойстваКлюча = Новый Структура;
	//	СвойстваКлюча.Вставить("Период", Выборка.Период);
	//	СвойстваКлюча.Вставить("Задача", Выборка.Задача);
	//	
	//	КлючЗаписи = РегистрыСведений.Трудозатраты.СоздатьКлючЗаписи(СвойстваКлюча);
	//Иначе
	//	КлючЗаписи = Неопределено;
	//КонецЕсли;

	//Возврат КлючЗаписи;
	
	Возврат XMLЗначение(Тип("ДокументСсылка.Трудозатраты"), Идентификатор);
	
КонецФункции

// Возвращает строку для фильтра, полученную изпараметра сеанса связанные филиалы.
// 
// Возвращаемое значение:
//  Строка -  значение гуидо филиалов
//
Функция ПолучитьФильтрИзСвязанныхФилиалов() Экспорт
	
	Массив = Новый Массив;
	
	Для Каждого Строка Из ПараметрыСеанса.СвязанныеФилиалы Цикл
		Массив.Добавить(Строка.УникальныйИдентификатор());	
	КонецЦикла;                                           
	
	Возврат СтрСоединить(Массив, " ");

КонецФункции

// Выполняет пометку на удаление документа трудозатрат
//
// Параметры:
//  Ссылка	 - ДокументСсылка.Трудозатраты	 - документ, которые требуется пометить на удаление
//
Процедура УдалитьТрудозатраты(Знач Ссылка) Экспорт
	
	Документы.Трудозатраты.УдалитьТрудозатраты(Ссылка);
	
КонецПроцедуры

// Проверяет количество фиилалов пользователя
// 
// Возвращаемое значение:
//   Булево 
//
Функция НесколькоФилиаловПользователя() Экспорт
		
	Возврат (ПараметрыСеанса.СвязанныеФилиалы.Количество() > 1
		ИЛИ ПараметрыСеанса.ДоступныеФилиалыРуководителя.Количество() > 1);
	
КонецФункции

// Возвращает нужные отпуска из "Классификатор использования рабочего времени"
// 
// Возвращаемое значение:
//  Массив - Массив отпусков
//
Функция ПолучитьВидыОтпусковСотрудника() Экспорт
	
	Отпуска = Новый Массив;	
	Отпуска.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПолучитьЭлементПоБуквенномуКоду("ОТ"));
	Отпуска.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПолучитьЭлементПоБуквенномуКоду("ОД"));
	
	Возврат Отпуска;
	
КонецФункции

Функция ПолучитьЗаголовокГиперссылкиТрудозатрат() Экспорт
	
	Результат = Новый Структура("Заголовок", 0);
	КоличествоЧасовЗаДень = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Трудозатраты.Затрата), 0) КАК СуммаТрудозатрат
	|ПОМЕСТИТЬ ТрудозатратыФакт
	|ИЗ
	|	РегистрСведений.Трудозатраты КАК Трудозатраты
	|ГДЕ
	|	Трудозатраты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Трудозатраты.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроизводственныйКалендарь.КоличествоРабочихЧасов * КоэффициентМинимальногоВремениТрудозатрат.Значение КАК ТрудозатратыПлан,
	|	ЕСТЬNULL(ТрудозатратыФакт.СуммаТрудозатрат, 0) КАК СуммаТрудозатрат
	|ИЗ
	|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.КоэффициентМинимальногоВремениТрудозатрат КАК КоэффициентМинимальногоВремениТрудозатрат
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудозатратыФакт КАК ТрудозатратыФакт
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ПроизводственныйКалендарь.ДатаКалендаря = &ДатаНачала";
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаСоСдвигом();
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата));
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		КоличествоЧасовЗаДень = Выборка.СуммаТрудозатрат;
		Если КоличествоЧасовЗаДень >= Выборка.ТрудозатратыПлан Тогда
			Результат.Вставить("Цвет", ЦветаСтиля.ЦветКорректногоЗначения);
		КонецЕсли;
	КонецЕсли;
	
	Результат.Заголовок = СтрШаблон("%1 час.", КоличествоЧасовЗаДень);
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область ПользовательскиеНастройки

// Возвращает ключи для получения и записи пользовательской настройки сортировки таблицы трудозатрат
// 
// Возвращаемое значение:
//  Структура
//
Функция КлючиНастройкиСортировкиСпискаТрудозатрат()
	
	Ключи = Новый Структура("КлючОбъекта,КлючНастроек", "СписокТрудозатрат", "СортироватьПоВозрастанию");
	Возврат Ключи;
	
КонецФункции

// Возвращает настройку сортировки списка трудозатрат, сохраненную текущим пользователем. 
// Если пользователь не сохранял настройку, то возвращает Истина (значение, соответствующее сортировке по возрастанию).
// 
// Возвращаемое значение:
//  Булево - Истина - сортировка по возрастанию, Ложь - сортировать по убыванию 
//
Функция НастройкаНаправленияСортировкиСпискаТрудозатрат() Экспорт
	
	КлючиНастройки = КлючиНастройкиСортировкиСпискаТрудозатрат();
	НастройкаСортировки = ОбщегоНазначенияВызовСервера.ЗагрузитьОбщиеНастройки(КлючиНастройки.КлючОбъекта, КлючиНастройки.КлючНастроек);
	
	Возврат ?(НастройкаСортировки = Неопределено, Истина, НастройкаСортировки);
	
КонецФункции

// Получает текущую настройку сортировки списка трудозатрат для текущего пользователя и записывает в настроки обратную полученной.
// Например, если настройка соответствовала сортировке по возрастанию, то будет сохранена настройка сортировки по убыванию (и наоборот).
// В случае, если настройка не была сохранена ранее, записывается настройка сортировки по убыванию.
// Возвращает новую настройку сортировки.
//
// Возвращаемое значение:
//  Булево - Истина - сортировка по возрастанию, Ложь - сортировать по убыванию 
//
Функция ИнвертироватьНастройкуСортировкиСпискаТрудозатрат() Экспорт 
 
	ТекущаяНастройкаСортировки = НастройкаНаправленияСортировкиСпискаТрудозатрат(); 
	НоваяНастройкаСортировки = НЕ ТекущаяНастройкаСортировки;
		 
	КлючиНастройки = КлючиНастройкиСортировкиСпискаТрудозатрат();
	ОбщегоНазначенияВызовСервера.СохранитьОбщиеНастройки(КлючиНастройки.КлючОбъекта, КлючиНастройки.КлючНастроек, НоваяНастройкаСортировки);
	
	Возврат НоваяНастройкаСортировки; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДляВнутреннегоЗадания()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнутреннееЗадание.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВнутреннееЗадание.Ссылка) КАК ПредставлениеОбъекта
	|ПОМЕСТИТЬ ТекущийДокумент
	|ИЗ
	|	Документ.ВнутреннееЗадание КАК ВнутреннееЗадание
	|ГДЕ
	|	ВнутреннееЗадание.Ссылка = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнутреннееЗадание.Ссылка КАК ВнутреннееЗаданиеВторойИерархии,
	|	ВнутреннееЗаданиеТретьейИерархии.Ссылка КАК ВнутреннееЗаданиеТретьейИерархии
	|ПОМЕСТИТЬ ПодчиненныеВнутренниеЗадания
	|ИЗ
	|	ТекущийДокумент КАК ТекущийДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееЗадание КАК ВнутреннееЗадание
	|		ПО ТекущийДокумент.Ссылка = ВнутреннееЗадание.ОбъектОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееЗадание КАК ВнутреннееЗаданиеТретьейИерархии
	|		ПО (ВнутреннееЗадание.Ссылка = ВнутреннееЗаданиеТретьейИерархии.ОбъектОснование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущийДокумент.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВсеДокументыДляРасчета
	|ИЗ
	|	ТекущийДокумент КАК ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРазработку.Ссылка
	|ИЗ
	|	ТекущийДокумент КАК ТекущийДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|		ПО ТекущийДокумент.Ссылка = ЗаявкаНаРазработку.ОбъектОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодчиненныеВнутренниеЗадания.ВнутреннееЗаданиеВторойИерархии
	|ИЗ
	|	ПодчиненныеВнутренниеЗадания КАК ПодчиненныеВнутренниеЗадания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРазработку.Ссылка
	|ИЗ
	|	ПодчиненныеВнутренниеЗадания КАК ПодчиненныеВнутренниеЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|		ПО ПодчиненныеВнутренниеЗадания.ВнутреннееЗаданиеВторойИерархии = ЗаявкаНаРазработку.ОбъектОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодчиненныеВнутренниеЗадания.ВнутреннееЗаданиеТретьейИерархии
	|ИЗ
	|	ПодчиненныеВнутренниеЗадания КАК ПодчиненныеВнутренниеЗадания
	|ГДЕ
	|	НЕ ПодчиненныеВнутренниеЗадания.ВнутреннееЗаданиеТретьейИерархии ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРазработку.Ссылка
	|ИЗ
	|	ПодчиненныеВнутренниеЗадания КАК ПодчиненныеВнутренниеЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|		ПО ПодчиненныеВнутренниеЗадания.ВнутреннееЗаданиеТретьейИерархии = ЗаявкаНаРазработку.ОбъектОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеДокументыДляРасчета.Ссылка КАК Объект,
	|	Трудозатраты.Филиал КАК Филиал,
	|	СУММА(ОказанныеУслугиОбороты.КоличествоОборот) КАК КоличествоЧасов,
	|	СУММА(ОказанныеУслугиОбороты.СуммаОборот) КАК ОбщаяСтоимость
	|ИЗ
	|	РегистрНакопления.ОказанныеУслуги.Обороты(
	|			,
	|			,
	|			Авто,
	|			ОбъектОснование В
	|				(ВЫБРАТЬ
	|					ВсеДокументыДляРасчета.Ссылка
	|				ИЗ
	|					ВсеДокументыДляРасчета)) КАК ОказанныеУслугиОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеДокументыДляРасчета КАК ВсеДокументыДляРасчета
	|		ПО ОказанныеУслугиОбороты.ОбъектОснование = ВсеДокументыДляРасчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Трудозатраты КАК Трудозатраты
	|		ПО ОказанныеУслугиОбороты.Регистратор = Трудозатраты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Трудозатраты.Филиал,
	|	ВсеДокументыДляРасчета.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбщаяСтоимость УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийДокумент.ПредставлениеОбъекта КАК ПредставлениеОбъекта
	|ИЗ
	|	ТекущийДокумент КАК ТекущийДокумент";

КонецФункции

Функция ТекстЗапросаДляЗаявкиНаРазработку()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаРазработку.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаявкаНаРазработку.Ссылка) КАК ПредставлениеОбъекта
	|ПОМЕСТИТЬ ТекущийДокумент
	|ИЗ
	|	Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|ГДЕ
	|	ЗаявкаНаРазработку.Ссылка = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийДокумент.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВсеДокументыДляРасчета
	|ИЗ
	|	ТекущийДокумент КАК ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеДокументыДляРасчета.Ссылка КАК Объект,
	|	Трудозатраты.Филиал КАК Филиал,
	|	СУММА(ОказанныеУслугиОбороты.КоличествоОборот) КАК КоличествоЧасов,
	|	СУММА(ОказанныеУслугиОбороты.СуммаОборот) КАК ОбщаяСтоимость
	|ИЗ
	|	РегистрНакопления.ОказанныеУслуги.Обороты(
	|			,
	|			,
	|			Авто,
	|			ОбъектОснование В
	|				(ВЫБРАТЬ
	|					ВсеДокументыДляРасчета.Ссылка
	|				ИЗ
	|					ВсеДокументыДляРасчета)) КАК ОказанныеУслугиОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеДокументыДляРасчета КАК ВсеДокументыДляРасчета
	|		ПО ОказанныеУслугиОбороты.ОбъектОснование = ВсеДокументыДляРасчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Трудозатраты КАК Трудозатраты
	|		ПО ОказанныеУслугиОбороты.Регистратор = Трудозатраты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Трудозатраты.Филиал,
	|	ВсеДокументыДляРасчета.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбщаяСтоимость УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийДокумент.ПредставлениеОбъекта КАК ПредставлениеОбъекта
	|ИЗ
	|	ТекущийДокумент КАК ТекущийДокумент";

КонецФункции

#КонецОбласти
